Перем U;

Процедура СтартПрограммы()
  U = ЗагрузитьСценарий("UfaScript.osb");
  // 10,10  - это минимальный размер консоли при которой программе разрешено запускаться
  U.НачальныеУстановкиСистемыUfaScript(10,10);
  
  // Неудачный пример    бесполезный
  С = Новый Структура();
  С.Вставить("Свойство", 5);
  С.Вставить("Метод", "Возврат "+С.Свойство+"+7;");
 
 М = Новый Массив;  М.Добавить(С.Метод);
 А=U.ВыполнитьКодИзМассива(М);
 Сообщить("1) "+А.Результат());
 
 // Создание первого объекта
 М = Новый Массив;  М.Добавить("Перем Свойство1 экспорт; Перем Свойство2;");
 М.Добавить("Функция СуммаСвойств(Парам) экспорт   Возврат Парам+Свойство1+Свойство2; КонецФункции");
 М.Добавить("Функция Конструктор() экспорт Свойство1=15; Свойство2=3;  КонецФункции ");
 О = U.СоздатьООПОбъект("Object1",М);  
 
 Сообщить("2) "+О.СуммаСвойств(4)); 
 Сообщить("3) "+О.Свойство1); 
 
// Создание наследника от первого 
 М = Новый Массив;  М.Добавить("Перем Свойство11 экспорт; Перем Свойство12;");
 М.Добавить("Функция НоваяФункция() экспорт   Свойство1 = 120; КонецФункции");
 М.Добавить("Функция ВозвратСвойства2() экспорт   Возврат Свойство2; КонецФункции");
 М.Добавить("#Переименовать Конструктор СтарыйКонструктор");
 М.Добавить("Функция Конструктор() экспорт  СтарыйКонструктор(); Свойство11=115; Свойство12=113; КонецФункции");
 
 О2 = U.СоздатьНаследникаООПОбъекта("Object1","Object2",М);

 Сообщить("4) "+О2.Свойство1); 
 Сообщить("5) "+О2.ВозвратСвойства2());
 Сообщить("6) "+О2.СуммаСвойств(7)); 
 

Сложение  = "А+Б";
Умножение = "А*Б";
Деление   = "А/Б";
 
Сообщить("10) "+Арифметика(3,2,"А+Б").Результат());
Сообщить("11) "+Арифметика(3,2,Умножение).Результат());

//Передаем функцию в качестве параметра.  Из-за неправильной отработки функции ЗагрузитьСценарий
//  Функцию нельзя размещать в модулях с исполняемым скриптом, а только в модулях с функциями.
// ВызватьФункцию см.ниже    Итог(3)  см.в конце ufascript.osb
 Сообщить("12) "+ВызватьФункцию("Итог(3)",ЭтотОбъект).Результат());
 
U.Консоль.Прочитать();

U.НарисоватьРамкуНаВесьЭкран();
U.Консоль.Прочитать();

 Сообщить("1) привет!!!                                     "); U.Консоль.Прочитать();

 // Удобнее объекты хранить ввиде образов в функциях типа  ОбразОбъектЭкрана
 Ф = U.СоздатьООПОбъект("ОбъектЭкрана",ОбразОбъектЭкрана(Новый Массив));    
 Ф.РегистрацияНаЭкране(U);   //  передаем U- указатель на подключенный UfaScript  По нему объект сможет обращаться
 //  к методам и общим с главной прогой свойствам библиотеки.  Регистрируем объект в массиве экранных объектов 
 Ф.Нарисовать();  // Рисуем объект

 // Меняем свойства у объекта и еще раз рисуем.
 Ф.Y = 20;   Ф.X = 21; Ф.ЦветТекста = ЦветКонсоли.Синий; Ф.РегистрацияНаЭкране(U); Ф.Нарисовать(); 
 
 //  Создаем наследника от ОбъектЭкрана
   Ф1=U.СоздатьНаследникаООПОбъекта("ОбъектЭкрана","Котик",ОбразОбъектКотик(Новый Массив));    Ф1.РегистрацияНаЭкране(U);
 Ф1.Нарисовать();  

 //  Создаем наследника подобие Котика  удобнее вторым спсобом из образов объектов, тогда родителя не надо создавать
 //  Ф2=U.СоздатьНаследникаООПОбъекта("ОбъектЭкрана","Собачка",ОбразОбъектКотик(Новый Массив));  
   Ф2=U.СоздатьООПОбъектИзМассива("Собачка",ОбразОбъектКотик(ОбразОбъектЭкрана(Новый Массив)));
   Ф2.РегистрацияНаЭкране(U);
   Ф2.Y = 23;
   Ф2.Нарисовать();  
 
U.Консоль.Прочитать();
 

КонецПроцедуры

Функция ОбразОбъектКотик(М)
  М.Добавить("#Переименовать Конструктор СтарыйКонструктор");
  М.Добавить("Функция Конструктор() экспорт  СтарыйКонструктор(); Y=13; X=15;  КонецФункции ");
  Возврат М;
КонецФункции


Функция ОбразОбъектЭкрана(М)
   М.Добавить("Перем Y экспорт; Перем X экспорт; Перем Экран Экспорт; Перем Текст Экспорт; "+
   "Перем ЦветФона Экспорт; Перем ЦветТекста Экспорт; Перем Индекс Экспорт;");
   М.Добавить("Функция Конструктор() экспорт Y=1; X=1; Текст=ИмяОбъекта; ЦветФона = ЦветКонсоли.Зеленый; ЦветТекста = ЦветКонсоли.Черный;  КонецФункции ");
   М.Добавить("Функция РегистрацияНаЭкране(UfaS) экспорт UfaScript=UfaS; Индекс=UfaScript.Экран.Количество();  "
      +"  UfaScript.Экран.Добавить(НашОбъект);   КонецФункции ");
	М.Добавить("Функция Нарисовать() экспорт UfaScript.Консоль.ЦветФона = ЦветФона; UfaScript.Консоль.КурсорВерх = Y; "+
        "UfaScript.Консоль.КурсорЛево = X; UfaScript.Консоль.ЦветТекста = ЦветТекста;  UfaScript.Консоль.Вывести(Текст);   КонецФункции");
   Возврат М;
КонецФункции


Функция Арифметика(А,Б,Функ)
  М = Новый Массив;  
  М.Добавить("А="+А+"; Б="+Б+"; С="+Функ+";");
  М.Добавить("Возврат С");
  Возврат U.ВыполнитьКодИзМассива(М);
КонецФункции

Функция ВызватьФункцию(Функ,T)
  М = Новый Массив;  
  М.Добавить("Т=ЗагрузитьСценарий(""UfaScript.osb"");");
  М.Добавить("Возврат Т."+Функ+";");
  Возврат U.ВыполнитьКодИзМассива(М);
КонецФункции


      СтартПрограммы();
